page_mismatch_tool/app/controllers/anomalies_controller.rb

  def index
    @anomalies = @project.anomalies.order(created_at: :desc)
    @anomalies = @anomalies.by_type(params[:anomaly_type]) if params[:anomaly_type].present?
---
SELECT "anomalies".* FROM "anomalies" WHERE "anomalies"."project_id" = 1 ORDER BY "anomalies"."created_at" DESC
SELECT 1 AS one FROM "anomalies" WHERE "anomalies"."project_id" = 1 LIMIT 1