page_mismatch_tool/app/controllers/batches_controller.rb

  def index
    @batches = @project.batches.order(created_at: :desc)
---
SELECT "batches".* FROM "batches" WHERE "batches"."project_id" = 1 ORDER BY "batches"."created_at" DESC

  def set_batch
    @batch = @project.batches.find(params[:id])
---
SELECT "batches".* FROM "batches" WHERE "batches"."project_id" = 1 AND "batches"."id" = 1 LIMIT 1