page_mismatch_tool/app/controllers/dashboard_controller.rb

  def index
    @total_projects = Project.count
    @total_anomalies = Anomaly.unresolved.count
    @recent_projects = Project.order(created_at: :desc).limit(5)
    @recent_anomalies = Anomaly.unresolved.order(created_at: :desc).limit(10)
    @projects_by_status = Project.group(:status).count
---
SELECT COUNT(*) FROM "projects"
SELECT COUNT(*) FROM "anomalies" WHERE "anomalies"."resolved" = FALSE
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC LIMIT 5
SELECT "anomalies".* FROM "anomalies" WHERE "anomalies"."resolved" = FALSE ORDER BY "anomalies"."created_at" DESC LIMIT 10
SELECT COUNT(*) AS "count_all", "projects"."status" AS "projects_status" FROM "projects" GROUP BY "projects"."status"