page_mismatch_tool/app/controllers/export_records_controller.rb

SELECT "export_records".* FROM "export_records" WHERE "export_records"."project_id" = 1 ORDER BY "export_records"."created_at" DESC
---
  def index
    @export_records = @project.export_records.order(created_at: :desc)