page_mismatch_tool/app/controllers/page_mappings_controller.rb

SELECT "page_mappings".* FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 ORDER BY "page_mappings"."pdf_page_index" ASC
SELECT COUNT(*) FROM "page_mappings" WHERE "page_mappings"."project_id" = 1
SELECT 1 AS one FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 LIMIT 1
---
  def index
    @page_mappings = @project.page_mappings.order(:pdf_page_index)
    @page_mappings = @page_mappings.by_status(params[:status]) if params[:status].present?