page_mismatch_tool/app/controllers/projects_controller.rb

  def index
    @projects = Project.all
    @projects = @projects.by_status(params[:status]) if params[:status].present?
    @projects = @projects.search(params[:q]) if params[:q].present?
    @projects = @projects.includes(:anomalies)
---
SELECT "projects".* FROM "projects"
SELECT 1 AS one FROM "projects" LIMIT 1
SELECT "anomalies".* FROM "anomalies" WHERE "anomalies"."project_id" IN (1, 2, 3, 4, 5)

  def show
    @page_mappings = @project.page_mappings.order(:pdf_page_index)
    @anomalies = @project.anomalies.unresolved
    @batches = @project.batches.order(created_at: :desc)
---
SELECT "page_mappings".* FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 ORDER BY "page_mappings"."pdf_page_index" ASC LIMIT 60
SELECT COUNT(*) FROM "page_mappings" WHERE "page_mappings"."project_id" = 1
SELECT "batches".* FROM "batches" WHERE "batches"."project_id" = 1 ORDER BY "batches"."created_at" DESC

  def set_project
    @project = Project.find(params.expect(:id))
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1