app/services/game_score_calculator.rb

  def initialize(game_session)
    @game_session = game_session
    @level = game_session.level
    @placements = game_session.container_placements.includes(:container, :berth)
---
SELECT "container_placements".* FROM "container_placements" WHERE "container_placements"."game_session_id" = 1
SELECT "containers".* FROM "containers" WHERE "containers"."id" IN (1, 3)