app/services/operation_processor.rb

  def place_container(container, berth, allow_warnings: false)
    @errors = []
    @conflicts = []

    conflicts = ConflictDetector.check_placement(@game_session, container, berth)
    @conflicts = conflicts

    errors = conflicts.select { |c| c[:severity] == :error }
    warnings = conflicts.select { |c| c[:severity] == :warning }

    unless errors.empty?
      @errors = errors.map { |e| e[:message] }
      return false
    end

    if warnings.any? && !allow_warnings
      @errors = warnings.map { |w| "警告: #{w[:message]}" }
      return false
    end

    ActiveRecord::Base.transaction do
      operation = @game_session.operations.create!(
        container: container,
        berth: berth,
        action_type: 'place',
        sequence: @game_session.next_sequence
      )

      @game_session.container_placements.create!(
        container: container,
        berth: berth
      )
---
INSERT INTO "operations" ("game_session_id", "container_id", "berth_id", "action_type", "sequence", "timestamp", "undone", "created_at", "updated_at") VALUES (1, 1, 1, 'place', 1, '2026-06-16 01:42:19.767650', FALSE, '2026-06-16 01:42:19.767937', '2026-06-16 01:42:19.767937') RETURNING "id"
INSERT INTO "container_placements" ("game_session_id", "container_id", "berth_id", "placed_at", "created_at", "updated_at") VALUES (1, 1, 1, '2026-06-16 01:42:19.769796', '2026-06-16 01:42:19.770443', '2026-06-16 01:42:19.770443') RETURNING "id"

  def undo
    @errors = []

    last_op = @game_session.last_operation
    unless last_op
      @errors << "没有可撤销的操作"
      return false
    end

    ActiveRecord::Base.transaction do
      case last_op.action_type
      when 'place'
        placement = @game_session.container_placements.find_by(
          container: last_op.container,
          berth: last_op.berth
        )
---
SELECT "container_placements".* FROM "container_placements" WHERE "container_placements"."game_session_id" = 1 AND "container_placements"."container_id" = 3 AND "container_placements"."berth_id" = 1 LIMIT 1
SELECT "containers".* FROM "containers" WHERE "containers"."id" = 3 LIMIT 1