app/views/grade_corrections/index.html.erb

SELECT "users".* FROM "users"
---
            <%= f.label :current_owner_id_eq, '责任人', class: 'block text-sm font-medium text-gray-700' %>
            <%= f.select :current_owner_id_eq, User.all.map { |u| [u.display_name, u.id] }, { include_blank: '全部' }, class: 'mt-1 block w-full rounded-md border-gray-300 shadow-sm focus:border-blue-500 focus:ring-blue-500 sm:text-sm' %>