app/views/grade_corrections/processing.html.erb

SELECT "attachments".* FROM "attachments" WHERE "attachments"."grade_correction_id" = 12 ORDER BY "attachments"."created_at" DESC
---
                    <%= label_tag :evidence_type, '证据类型', class: 'block text-sm font-medium text-gray-700' %>
                    <%= select_tag :evidence_type, options_for_select(Attachment::EVIDENCE_TYPES.map { |k, v| [v, k] }), class: 'mt-1 block w-full rounded-md border-gray-300 shadow-sm focus:border-blue-500 focus:ring-blue-500 sm:text-sm' %>

SELECT "processing_nodes".* FROM "processing_nodes" WHERE "processing_nodes"."grade_correction_id" = 12 ORDER BY "processing_nodes"."created_at" ASC
---
                  </div>
                  <% if index < @grade_correction.processing_nodes.size - 1 %>