app/views/grade_corrections/review.html.erb

SELECT "processing_nodes".* FROM "processing_nodes" WHERE "processing_nodes"."grade_correction_id" = 16 ORDER BY "processing_nodes"."created_at" ASC
---
                  </div>
                  <% if index < @grade_correction.processing_nodes.size - 1 %>

SELECT "diff_records".* FROM "diff_records" WHERE "diff_records"."grade_correction_id" = 16 ORDER BY "diff_records"."created_at" DESC
SELECT 1 AS one FROM "diff_records" WHERE "diff_records"."grade_correction_id" = 16 LIMIT 1
---
                  <p class="text-xs text-gray-400 mt-1"><%= node.operator&.name %></p>
                  <% if node.business_record.present? %>