app/views/grade_corrections/show.html.erb

                </div>
                <% if index < @grade_correction.processing_nodes.size - 1 %>
---
SELECT "processing_nodes".* FROM "processing_nodes" WHERE "processing_nodes"."grade_correction_id" = 10 ORDER BY "processing_nodes"."created_at" ASC

                  <span>操作人: <%= node.operator&.display_name %></span>
                  <% if node.business_record.present? %>
---
SELECT "diff_records".* FROM "diff_records" WHERE "diff_records"."grade_correction_id" = 10 ORDER BY "diff_records"."created_at" DESC
SELECT 1 AS one FROM "diff_records" WHERE "diff_records"."grade_correction_id" = 10 LIMIT 1

                    <div class="space-y-1">
                      <% node.attachments.each do |att| %>
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."grade_correction_id" = 10 ORDER BY "attachments"."created_at" DESC