page_mismatch_tool/app/views/projects/show.html.erb

        </div>
        <% export_records = @project.export_records.order(created_at: :desc).limit(5) %>
---
SELECT "export_records".* FROM "export_records" WHERE "export_records"."project_id" = 1 ORDER BY "export_records"."created_at" DESC LIMIT 5