page_mismatch_tool/app/services/anomaly_detector.rb

DELETE FROM "anomalies" WHERE "anomalies"."id" = 1
---
  def detect!
    @project.anomalies.unresolved.destroy_all

SELECT "page_mappings"."actual_page_number" FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."actual_page_number" IS NOT NULL ORDER BY "page_mappings"."actual_page_number" ASC
INSERT INTO "anomalies" ("anomaly_type", "created_at", "description", "page_mapping_id", "project_id", "resolved", "updated_at") VALUES ('missing', '2026-06-17 22:53:53.247685', '缺失页码：第43页在页码序列中缺失', NULL, 1, FALSE, '2026-06-17 22:53:53.247685') RETURNING "id"
---
  def detect_missing_pages
    count = 0
    numbers = @project.page_mappings.where.not(actual_page_number: nil).order(:actual_page_number).pluck(:actual_page_number).uniq.sort
    return count if numbers.size < 2

    (numbers.first..numbers.last).each do |n|
      unless numbers.include?(n)
        @project.anomalies.create!(
          anomaly_type: Anomaly::MISSING,
          description: "缺失页码：第#{n}页在页码序列中缺失"
        )

SELECT "page_mappings"."actual_page_number" FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."actual_page_number" IS NOT NULL GROUP BY "page_mappings"."actual_page_number" HAVING (COUNT(*) > 1)
SELECT "page_mappings".* FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."actual_page_number" = 14
INSERT INTO "anomalies" ("anomaly_type", "created_at", "description", "page_mapping_id", "project_id", "resolved", "updated_at") VALUES ('duplicate', '2026-06-17 22:53:53.277957', '重复页码：页码14出现多次', 14, 1, FALSE, '2026-06-17 22:53:53.277957') RETURNING "id"
---
  def detect_duplicate_pages
    count = 0
    grouped = @project.page_mappings.where.not(actual_page_number: nil).group(:actual_page_number).having("COUNT(*) > 1").pluck(:actual_page_number)
    grouped.each do |page_num|
      mappings = @project.page_mappings.where(actual_page_number: page_num)
      mappings.each do |mapping|
        @project.anomalies.create!(
          anomaly_type: Anomaly::DUPLICATE,
          page_mapping: mapping,
          description: "重复页码：页码#{page_num}出现多次"
        )

SELECT "page_mappings".* FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."status" = 'inserted' ORDER BY "page_mappings"."id" ASC LIMIT 1000
INSERT INTO "anomalies" ("anomaly_type", "created_at", "description", "page_mapping_id", "project_id", "resolved", "updated_at") VALUES ('inserted', '2026-06-17 22:53:53.358138', '插入页面：PDF索引46对应的页面为插入页面', 46, 1, FALSE, '2026-06-17 22:53:53.358138') RETURNING "id"
---
  def detect_inserted_pages
    count = 0
    @project.page_mappings.where(status: PageMapping::INSERTED).find_each do |mapping|
      @project.anomalies.create!(
        anomaly_type: Anomaly::INSERTED,
        page_mapping: mapping,
        description: "插入页面：PDF索引#{mapping.pdf_page_index}对应的页面为插入页面"
      )

SELECT "page_mappings".* FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."status" = 'misnumbered' ORDER BY "page_mappings"."id" ASC LIMIT 1000
INSERT INTO "anomalies" ("anomaly_type", "created_at", "description", "page_mapping_id", "project_id", "resolved", "updated_at") VALUES ('misnumbered', '2026-06-17 22:53:53.360875', '编号错误：PDF索引88对应的页面编号为80，编号可能有误', 88, 1, FALSE, '2026-06-17 22:53:53.360875') RETURNING "id"
---
  def detect_misnumbered_pages
    count = 0
    @project.page_mappings.where(status: PageMapping::MISNUMBERED).find_each do |mapping|
      @project.anomalies.create!(
        anomaly_type: Anomaly::MISNUMBERED,
        page_mapping: mapping,
        description: "编号错误：PDF索引#{mapping.pdf_page_index}对应的页面编号为#{mapping.actual_page_number}，编号可能有误"
      )

SELECT "page_mappings".* FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."pdf_page_index" IS NOT NULL AND "page_mappings"."actual_page_number" IS NOT NULL ORDER BY "page_mappings"."id" ASC LIMIT 1000
INSERT INTO "anomalies" ("anomaly_type", "created_at", "description", "page_mapping_id", "project_id", "resolved", "updated_at") VALUES ('misnumbered', '2026-06-17 22:54:11.272079', '页码偏移过大：PDF索引47与实际页码44偏差为3，超过阈值2', 47, 1, FALSE, '2026-06-17 22:54:11.272079') RETURNING "id"
---
  def detect_offset_divergence
    count = 0
    @project.page_mappings.where.not(pdf_page_index: nil).where.not(actual_page_number: nil).find_each do |mapping|
      offset = (mapping.pdf_page_index - mapping.actual_page_number).abs
      if offset > OFFSET_THRESHOLD
        @project.anomalies.create!(
          anomaly_type: Anomaly::MISNUMBERED,
          page_mapping: mapping,
          description: "页码偏移过大：PDF索引#{mapping.pdf_page_index}与实际页码#{mapping.actual_page_number}偏差为#{offset}，超过阈值#{OFFSET_THRESHOLD}"
        )

UPDATE "page_mappings" SET "status" = 'missing' WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."actual_page_number" = 43
UPDATE "page_mappings" SET "status" = 'duplicate' WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."id" IN (14, 15, 16, 83, 88, 84, 89, 85, 90, 86, 91, 87, 92)
UPDATE "page_mappings" SET "status" = 'inserted' WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."id" = 46
UPDATE "page_mappings" SET "status" = 'misnumbered' WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."id" IN (88, 89, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120)
---
  def update_page_mapping_statuses
    missing_numbers = @project.anomalies.by_type(Anomaly::MISSING).pluck(:description).map { |d| d[/第(\d+)页/, 1]&.to_i }.compact
    duplicate_mapping_ids = @project.anomalies.by_type(Anomaly::DUPLICATE).pluck(:page_mapping_id).compact
    inserted_mapping_ids = @project.anomalies.by_type(Anomaly::INSERTED).pluck(:page_mapping_id).compact
    misnumbered_mapping_ids = @project.anomalies.by_type(Anomaly::MISNUMBERED).pluck(:page_mapping_id).compact

    @project.page_mappings.where(actual_page_number: missing_numbers).update_all(status: PageMapping::MISSING)
    @project.page_mappings.where(id: duplicate_mapping_ids).update_all(status: PageMapping::DUPLICATE)
    @project.page_mappings.where(id: inserted_mapping_ids).update_all(status: PageMapping::INSERTED)
    @project.page_mappings.where(id: misnumbered_mapping_ids).update_all(status: PageMapping::MISNUMBERED)