page_mismatch_tool/app/services/page_mapping_batch_numberer.rb

SELECT "page_mappings".* FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 ORDER BY "page_mappings"."pdf_page_index" ASC
UPDATE "page_mappings" SET "actual_page_number" = 46, "notes" = '46', "updated_at" = '2026-06-17 22:54:11.551647' WHERE "page_mappings"."id" = 46
UPDATE "page_mappings" SET "actual_page_number" = 15, "notes" = '15', "updated_at" = '2026-06-17 22:54:11.489582' WHERE "page_mappings"."id" = 15
---
  def number!
    count = 0
    current_number = @options[:start_number]
    prefix = @options[:prefix]
    suffix = @options[:suffix]
    increment = @options[:increment]

    mappings = @project.page_mappings.order(:pdf_page_index)

    mappings.each do |mapping|
      label = build_label(current_number, prefix, suffix)

      if mapping.status == PageMapping::INSERTED
        mapping.update!(actual_page_number: current_number, notes: label)
        mapping.update!(status: PageMapping::INSERTED)
      else
        mapping.update!(actual_page_number: current_number, notes: label)