app/views/levels/index.html.erb

SELECT MAX("game_sessions"."score") FROM "game_sessions" WHERE "game_sessions"."player_id" = 1 AND "game_sessions"."level_id" = 1 AND "game_sessions"."status" = 'won'
SELECT COUNT(*) FROM "game_sessions" WHERE "game_sessions"."player_id" = 1 AND "game_sessions"."level_id" = 1
---
    <%
      best_score = @player.game_sessions.where(level: level, status: 'won').maximum(:score) || 0
      attempts = @player.game_sessions.where(level: level).count
      wins = @player.game_sessions.where(level: level, status: 'won').count