app/views/levels/show.html.erb

SELECT "containers".* FROM "containers" WHERE "containers"."level_id" = 1 ORDER BY "containers"."id" ASC
---
      <div class="grid grid-cols-2 md:grid-cols-3 lg:grid-cols-5 gap-3">
        <% @level.sorted_containers.each do |container| %>