app/controllers/dashboard_controller.rb

  def review
    @statistics = GradeCorrection.statistics
    @pending_review = GradeCorrection.by_status('reviewing').includes(:current_owner, :processing_nodes)
---
SELECT "grade_corrections".* FROM "grade_corrections" WHERE "grade_corrections"."status" = 'processing'
SELECT "processing_nodes".* FROM "processing_nodes" WHERE "processing_nodes"."grade_correction_id" = 13 ORDER BY "processing_nodes"."created_at" ASC

  def statistics
    @pending_count = GradeCorrection.by_status('pending').count
    @processing_count = GradeCorrection.by_status('processing').count
    @reviewing_count = GradeCorrection.by_status('reviewing').count
    @archived_count = GradeCorrection.by_status('archived').count
    @rejected_count = GradeCorrection.by_status('rejected').count
    @returned_count = GradeCorrection.by_status('returned').count
    @unconfirmed_count = GradeCorrection.notification_unconfirmed.count
    @blocked_count = GradeCorrection.with_block_reason.count

    @source_counts = GradeCorrection.group(:source).count
    @evidence_counts = GradeCorrection.group(:evidence_conclusion).count

    @assignee_counts = GradeCorrection.where.not(current_owner_id: nil).group(:current_owner_id).count.transform_keys do |id|
      User.find_by(id: id)
    end.compact

    score_diffs = GradeCorrection.where.not(corrected_score: nil).where.not(original_score: nil)
                                  .pluck(Arel.sql('corrected_score - original_score')).compact
    @score_diff_ranges = {
      '0-5分' => score_diffs.count { |d| d <= 5 },
      '6-10分' => score_diffs.count { |d| d > 5 && d <= 10 },
      '11-20分' => score_diffs.count { |d| d > 10 && d <= 20 },
      '20分以上' => score_diffs.count { |d| d > 20 }
    }

    amounts = GradeCorrection.pluck(:amount).compact
    @total_amount = amounts.sum
    @avg_amount = amounts.any? ? amounts.sum / amounts.size : 0

    processing_times = GradeCorrection.where(status: :archived)
      .joins(:processing_nodes)
      .where(processing_nodes: { node_type: ['accept', 'approve'] })
      .group('grade_corrections.id')
      .pluck(Arel.sql('EXTRACT(EPOCH FROM (MAX(processing_nodes.created_at) - MIN(processing_nodes.created_at))) / 3600'))
---
SELECT COUNT(*) FROM "grade_corrections" WHERE "grade_corrections"."status" = 'pending'
SELECT COUNT(*) FROM "grade_corrections" WHERE "grade_corrections"."status" = 'processing'
SELECT COUNT(*) FROM "grade_corrections" WHERE "grade_corrections"."status" = 'reviewing'
SELECT COUNT(*) FROM "grade_corrections" WHERE "grade_corrections"."status" = 'archived'
SELECT COUNT(*) FROM "grade_corrections" WHERE "grade_corrections"."status" = 'rejected'
SELECT COUNT(*) FROM "grade_corrections" WHERE "grade_corrections"."status" = 'returned'
SELECT COUNT(*) FROM "grade_corrections" WHERE "grade_corrections"."block_reason" IS NOT NULL
SELECT COUNT(*) AS "count_all", "grade_corrections"."source" AS "grade_corrections_source" FROM "grade_corrections" GROUP BY "grade_corrections"."source"
SELECT COUNT(*) AS "count_all", "grade_corrections"."evidence_conclusion" AS "grade_corrections_evidence_conclusion" FROM "grade_corrections" GROUP BY "grade_corrections"."evidence_conclusion"
SELECT COUNT(*) AS "count_all", "grade_corrections"."current_owner_id" AS "grade_corrections_current_owner_id" FROM "grade_corrections" WHERE "grade_corrections"."current_owner_id" IS NOT NULL GROUP BY "grade_corrections"."current_owner_id"
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
SELECT corrected_score - original_score FROM "grade_corrections" WHERE "grade_corrections"."corrected_score" IS NOT NULL AND "grade_corrections"."original_score" IS NOT NULL
SELECT "grade_corrections"."amount" FROM "grade_corrections"
SELECT EXTRACT(EPOCH FROM (MAX(processing_nodes.created_at) - MIN(processing_nodes.created_at))) / 3600 FROM "grade_corrections" INNER JOIN "processing_nodes" ON "processing_nodes"."grade_correction_id" = "grade_corrections"."id" WHERE "grade_corrections"."status" = 'archived' AND "processing_nodes"."node_type" IN ('accept', 'approve') GROUP BY "grade_corrections"."id"

    @min_processing_hours = processing_times.min || 0
    @max_processing_hours = processing_times.max || 0

    @field_change_counts = DiffRecord.group(:field_name).count
---
SELECT COUNT(*) AS "count_all", "diff_records"."field_name" AS "diff_records_field_name" FROM "diff_records" GROUP BY "diff_records"."field_name"