app/controllers/game_sessions_controller.rb

INSERT INTO "game_sessions" ("player_id", "level_id", "score", "started_at", "finished_at", "status", "time_remaining", "created_at", "updated_at") VALUES (1, 1, 0, '2026-06-16 01:42:03.803959', NULL, 'playing', 180, '2026-06-16 01:42:03.803845', '2026-06-16 01:42:03.803845') RETURNING "id"
---
  def create
    @game_session = GameSession.new(game_session_params)
    @game_session.status = :initialized

    if @game_session.save