app/controllers/game_sessions_controller.rb

  def create
    level = Level.find(params[:level_id])
    @game_session = current_player.game_sessions.create!(level: level)
---
SELECT "levels".* FROM "levels" WHERE "levels"."id" = 1 LIMIT 1
INSERT INTO "game_sessions" ("player_id", "level_id", "score", "started_at", "finished_at", "status", "time_remaining", "created_at", "updated_at") VALUES (1, 1, 0, '2026-06-16 01:42:03.803959', NULL, 'playing', 180, '2026-06-16 01:42:03.803845', '2026-06-16 01:42:03.803845') RETURNING "id"

  def result
    @game_session = current_player.game_sessions.find(params[:id])
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = 1 LIMIT 1

  def find_game_session
    @game_session = current_player.game_sessions.find(params[:id])
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = 1 LIMIT 1