app/controllers/grade_corrections_controller.rb

    scope = @q.result.includes(:current_owner, :processing_nodes).order(created_at: :desc)
---
SELECT "processing_nodes".* FROM "processing_nodes" WHERE "processing_nodes"."grade_correction_id" IN (16, 15, 14, 13, 12, 11, 10) ORDER BY "processing_nodes"."created_at" ASC

  def show
    authorize @grade_correction
    @diff_records = @grade_correction.diff_records.order(created_at: :desc)
    @attachments = @grade_correction.attachments.order(created_at: :desc)
---
SELECT "diff_records".* FROM "diff_records" WHERE "diff_records"."grade_correction_id" = 10 ORDER BY "diff_records"."created_at" DESC
SELECT "attachments".* FROM "attachments" WHERE "attachments"."grade_correction_id" = 10 ORDER BY "attachments"."created_at" DESC

  def processing
    authorize @grade_correction
    @diff_records = @grade_correction.diff_records.order(created_at: :desc)
    @attachments = @grade_correction.attachments.order(created_at: :desc)
---
SELECT "diff_records".* FROM "diff_records" WHERE "diff_records"."grade_correction_id" = 12 ORDER BY "diff_records"."created_at" DESC
SELECT "attachments".* FROM "attachments" WHERE "attachments"."grade_correction_id" = 12 ORDER BY "attachments"."created_at" DESC

  def review
    authorize @grade_correction
    @diff_records = @grade_correction.diff_records.order(created_at: :desc)
---
SELECT "diff_records".* FROM "diff_records" WHERE "diff_records"."grade_correction_id" = 16 ORDER BY "diff_records"."created_at" DESC

  def set_grade_correction
    @grade_correction = GradeCorrection.find(params[:id])
---
SELECT "grade_corrections".* FROM "grade_corrections" WHERE "grade_corrections"."id" = 1 LIMIT 1