app/controllers/home_controller.rb

  def index
    find_or_create_local_player
    @levels = Level.all.order(difficulty: :asc)
    @player = Player.find(session[:player_id])
    @recent_games = @player.game_sessions.completed.order(finished_at: :desc).limit(5)
    @total_score = @player.game_sessions.where(status: 'won').sum(:score)
---
SELECT "levels".* FROM "levels" ORDER BY "levels"."difficulty" ASC
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
SELECT SUM("game_sessions"."score") FROM "game_sessions" WHERE "game_sessions"."player_id" = 1 AND "game_sessions"."status" = 'won'