app/controllers/leaderboards_controller.rb

  def index
    @global_scores = GameSession
                       .where(status: 'won')
                       .includes(:player, :level)
                       .order(score: :desc)
                       .limit(50)
                       .group_by(&:level)

    @by_level = Level.all.order(difficulty: :asc).index_with do |level|
      GameSession
        .where(level: level, status: 'won')
        .includes(:player)
        .order(score: :desc)
        .limit(10)
    end

    @player_rankings = {}
    current_player = Player.find(session[:player_id])
---
SELECT "levels".* FROM "levels" ORDER BY "levels"."difficulty" ASC
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1