app/controllers/levels_controller.rb

  def index
    @levels = Level.all.order(difficulty: :asc, name: :asc)
---
SELECT "levels".* FROM "levels" ORDER BY "levels"."difficulty" ASC, "levels"."name" ASC

  def show
    @player = current_player
    @best_score = @player.game_sessions
                          .where(level: @level, status: 'won')
                          .maximum(:score) || 0
---
SELECT MAX("game_sessions"."score") FROM "game_sessions" WHERE "game_sessions"."player_id" = 1 AND "game_sessions"."level_id" = 1 AND "game_sessions"."status" = 'won'

  def set_level
    @level = Level.find(params[:id])
---
SELECT "levels".* FROM "levels" WHERE "levels"."id" = 1 LIMIT 1

  def current_player
    @current_player ||= Player.find(session[:player_id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1