app/controllers/sessions_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @users = User.all