page_mismatch_tool/app/models/project.rb

  def missing_page_count
    page_mappings.where(status: PageMapping::MISSING).count
---
SELECT COUNT(*) FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."status" = 'missing'

  def duplicate_page_count
    page_mappings.where(status: PageMapping::DUPLICATE).count
---
SELECT COUNT(*) FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."status" = 'duplicate'

  def inserted_page_count
    page_mappings.where(status: PageMapping::INSERTED).count
---
SELECT COUNT(*) FROM "page_mappings" WHERE "page_mappings"."project_id" = 1 AND "page_mappings"."status" = 'inserted'