app/models/grade_correction.rb

SELECT COUNT(*) AS "count_all", DATE_TRUNC('month', "grade_corrections"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_month_grade_corrections_created_at_timestamptz_at_ti" FROM "grade_corrections" WHERE "grade_corrections"."created_at" BETWEEN '2025-12-12 23:25:14.287833' AND '2026-06-12 23:25:14.287935' AND ("grade_corrections"."created_at" IS NOT NULL) GROUP BY DATE_TRUNC('month', "grade_corrections"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date
---
    def monthly_statistics
      where(created_at: 6.months.ago..Time.now)
        .group_by_month(:created_at)
        .count

INSERT INTO "processing_nodes" ("grade_correction_id", "node_type", "operator_id", "status", "content", "on_site_explanation", "business_record", "created_at", "updated_at") VALUES (10, 'create', 6, 'archived', '申请提交', NULL, NULL, '2026-06-12 23:06:04.665082', '2026-06-12 23:06:04.665082') RETURNING "id"
---
  def create_node(node_type:, operator:, content:, status: nil, on_site_explanation: nil, business_record: nil)
    processing_nodes.create!(
      node_type: node_type,
      operator: operator,
      content: content,
      status: status || self.status,
      on_site_explanation: on_site_explanation,
      business_record: business_record
    )