app/models/player.rb

SELECT "players".* FROM "players" WHERE "players"."name" = 'LocalPlayer' LIMIT 1
---
  def self.find_or_create_local_player(name = 'LocalPlayer')
    Player.find_or_create_by!(name: name) do |player|