app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "users"
---
            <div class="flex items-center space-x-4">
              <% if User.count > 1 %>